[
  {
    "title": "Work Experience",
    "entries": [
      {
        "company": "Iteriam",
        "location": "Madrid, ESP",
        "job": "FullStack Developer",
        "year": "2024-current",
        "items": [
          "Focused on improving data traceability and integrity in communications throughout the claims process.",
          "Collaboration with the team using agile methodologies to deliver features and improvements iteratively.",
          "Active involvement in an architectural migration from multiple independent microservices to a simplified structure with a single central microservice and a BFF.",
          "Use of OpenAPI to describe the API in a fast and standardized way."
        ]
      },
      {
        "company": "Cargo Produce",
        "location": "Austin, USA",
        "job": "FullStack Developer",
        "year": "2023-2024",
        "items": [
          "Designed and implemented a module to automate the calculation of carbon footprint for container journeys upon arrival at their destination.",
          "Collaborated with a team of 9 developers, following Agile methodologies with Jira for task management.",
          "Utilized PostgreSQL with DBeaver for database management, including modifying and updating stored procedures in PL/SQL.",
          "Analyzed user stories, provided time estimates, and reviewed code in pull requests to ensure quality and adherence to best practices."
        ]
      },
      {
        "company": "Ingenea SRL",
        "location": "Rosario, ARG",
        "job": "FullStack Developer",
        "year": "2021-2023",
        "items": [
          "Builded a dashboard for customer’s projects displaying various types of charts, alerts, summaries, and project information using Angular and .NET.",
          "Created a web application that also displays information about customer’s contracts with different indicators such as charts, alerts and spent budgets.",
          "Participated in the development of an application for track and trace trucks via GPS using Google Maps API."
        ]
      }
    ]
  },
  {
    "title": "Education",
    "entries": [
      {
        "job": "Systems of Information Engineering",
        "year": "2017-2024",
        "items": [
          "For the final project I designed and developed a web platform with Angular and Express that connects musicians and bands.",
          "Overall average: 7.68"
        ]
      }
    ]
  },
  {
    "title": "Additional Skills",
    "entries": [
      {
        "items": [
          "Technical Skills: Angular, .NET, Entity Framework, Typescript, Javascript, C#, Git, SQL, HTML, CSS, Scrum, Kanban, Jira, Astro, Express, NodeJS, React, Java, Spring Boot.",
          "Languages: Fluent in Spanish (native), Conversational in English.",
          "Certifications: First Certificate in English Level B2 - FullStack Open course from Helsinki University"
        ]
      }
    ]
  }
]
